In [1]:
import pandas as pd
import numpy as np

In [2]:
from IPython.core.interactiveshell import InteractiveShell
InteractiveShell.ast_node_interactivity = "all"

### EDA - Exploratory Data Analysis
#### metadata and univariate statistics

In [3]:
college = pd.read_csv('data/college.csv')
college.head()

,INSTNM,CITY,STABBR,HBCU,MENONLY,WOMENONLY,RELAFFIL,SATVRMID,SATMTMID,DISTANCEONLY,...,UGDS_2MOR,UGDS_NRA,UGDS_UNKN,PPTUG_EF,CURROPER,PCTPELL,PCTFLOAN,UG25ABV,MD_EARN_WNE_P10,GRAD_DEBT_MDN_SUPP
0,Alabama A & M University,Normal,AL,1.0,0.0,0.0,0,424.0,420.0,0.0,...,0.0000,0.0059,0.0138,0.0656,1,0.7356,0.8284,0.1049,30300,33888
1,University of Alabama at Birmingham,Birmingham,AL,0.0,0.0,0.0,0,570.0,565.0,0.0,...,0.0368,0.0179,0.0100,0.2607,1,0.3460,0.5214,0.2422,39700,21941.5
2,Amridge University,Montgomery,AL,0.0,0.0,0.0,1,NaN,NaN,1.0,...,0.0000,0.0000,0.2715,0.4536,1,0.6801,0.7795,0.8540,40100,23370
3,University of Alabama in Huntsville,Huntsville,AL,0.0,0.0,0.0,0,595.0,590.0,0.0,...,0.0172,0.0332,0.0350,0.2146,1,0.3072,0.4596,0.2640,45500,24097
4,Alabama State University,Montgomery,AL,1.0,0.0,0.0,0,425.0,430.0,0.0,...,0.0098,0.0243,0.0137,0.0892,1,0.7347,0.7554,0.1270,26600,33118.5

In [4]:
college.shape

(7535, 27)

In [5]:
college.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7535 entries, 0 to 7534
Data columns (total 27 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   INSTNM              7535 non-null   object
 1   CITY                7535 non-null   object
 2   STABBR              7535 non-null   object
 3   HBCU                7164 non-null   float64
 4   MENONLY             7164 non-null   float64
 5   WOMENONLY           7164 non-null   float64
 6   RELAFFIL            7535 non-null   int64
 7   SATVRMID            1185 non-null   float64
 8   SATMTMID            1196 non-null   float64
 9   DISTANCEONLY        7164 non-null   float64
 10  UGDS                6874 non-null   float64
 11  UGDS_WHITE          6874 non-null   float64
 12  UGDS_BLACK          6874 non-null   float64
 13  UGDS_HISP           6874 non-null   float64
 14  UGDS_ASIAN          6874 non-null   float64
 15  UGDS_AIAN           6874 non-null   float64
 16  UGDS_NHPI           6874 non-null   float64
 17  UGDS_2MOR           6874 non-null   float64
 18  UGDS_NRA            6874 non-null   float64
 19  UGDS_UNKN           6874 non-null   float64
 20  PPTUG_EF            6853 non-null   float64
 21  CURROPER            7535 non-null   int64
 22  PCTPELL             6849 non-null   float64
 23  PCTFLOAN            6849 non-null   float64
 24  UG25ABV             6718 non-null   float64
 25  MD_EARN_WNE_P10     6413 non-null   object
 26  GRAD_DEBT_MDN_SUPP  7503 non-null   object
dtypes: float64(20), int64(2), object(5)
memory usage: 1.6+ MB

In [6]:
college.describe(include=[np.number]).T.head()

            count        mean        std    min    25%    50%    75%    max
HBCU       7164.0    0.014238   0.118478    0.0    0.0    0.0    0.0    1.0
MENONLY    7164.0    0.009213   0.095546    0.0    0.0    0.0    0.0    1.0
WOMENONLY  7164.0    0.005304   0.072642    0.0    0.0    0.0    0.0    1.0
RELAFFIL   7535.0    0.190975   0.393096    0.0    0.0    0.0    0.0    1.0
SATVRMID   1185.0  522.819409  68.578862  290.0  475.0  510.0  555.0  765.0

In [7]:
college.describe(include=[object, pd.Categorical]).T

                   count unique                      top  freq
INSTNM              7535   7535  American Indian OIC Inc     1
CITY                7535   2514                 New York    87
STABBR              7535     59                       CA   773
MD_EARN_WNE_P10     6413    598        PrivacySuppressed   822
GRAD_DEBT_MDN_SUPP  7503   2038        PrivacySuppressed  1510

In [8]:
college.describe(include=[np.number],
                percentiles=[.01, .10, .25, .75, .95, .99]).T.head()

,count,mean,std,min,1%,10%,25%,50%,75%,95%,99%,max
HBCU,7164.0,0.014238,0.118478,0.0,0.0,0.0,0.0,0.0,0.0,0.0,1.0,1.0
MENONLY,7164.0,0.009213,0.095546,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,1.0
WOMENONLY,7164.0,0.005304,0.072642,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,1.0
RELAFFIL,7535.0,0.190975,0.393096,0.0,0.0,0.0,0.0,0.0,0.0,1.0,1.0,1.0
SATVRMID,1185.0,522.819409,68.578862,290.0,390.0,447.4,475.0,510.0,555.0,665.0,730.0,765.0

In [9]:
pd.read_csv('data/college_data_dictionary.csv').head()

  column_name                               description
0      INSTNM                          Institution Name
1        CITY                             City Location
2      STABBR                        State Abbreviation
3        HBCU  Historically Black College or University
4     MENONLY                              0/1 Men Only

### memory reduction from dataset

In [10]:
college = pd.read_csv('data/college.csv')
different_cols = ['RELAFFIL', 'SATMTMID', 'CURROPER', 'INSTNM', 'STABBR']
col2 = college.loc[:, different_cols]
col2.head()

   RELAFFIL  SATMTMID  CURROPER                               INSTNM STABBR
0         0     420.0         1             Alabama A & M University     AL
1         0     565.0         1  University of Alabama at Birmingham     AL
2         1       NaN         1                   Amridge University     AL
3         0     590.0         1  University of Alabama in Huntsville     AL
4         0     430.0         1             Alabama State University     AL

In [11]:
col2.dtypes

RELAFFIL      int64
SATMTMID    float64
CURROPER      int64
INSTNM       object
STABBR       object
dtype: object

In [12]:
mem_usage = col2.memory_usage(deep=True)
mem_usage

Index          128
RELAFFIL     60280
SATMTMID     60280
CURROPER     60280
INSTNM      660240
STABBR      444565
dtype: int64

In [13]:
col2['RELAFFIL'] = col2['RELAFFIL'].astype(np.int8)

In [14]:
col2.dtypes

RELAFFIL       int8
SATMTMID    float64
CURROPER      int64
INSTNM       object
STABBR       object
dtype: object

In [15]:
col2.memory_usage(deep=True)

Index          128
RELAFFIL      7535
SATMTMID     60280
CURROPER     60280
INSTNM      660240
STABBR      444565
dtype: int64

In [16]:
col2.select_dtypes(include=['object']).nunique()

INSTNM    7535
STABBR      59
dtype: int64

In [17]:
col2['STABBR'] = col2['STABBR'].astype('category')  # changing to caegory reduces memory

In [18]:
new_mem = col2.memory_usage(deep=True)
new_mem

Index          128
RELAFFIL      7535
SATMTMID     60280
CURROPER     60280
INSTNM      660699
STABBR       13120
dtype: int64

In [19]:
((new_mem - mem_usage) / mem_usage) * 100  # % reduction in the memory for columns

Index        0.000000
RELAFFIL   -87.500000
SATMTMID     0.000000
CURROPER     0.000000
INSTNM       0.069520
STABBR     -97.048801
dtype: float64

In [20]:
college[['CURROPER', 'INSTNM']].memory_usage(deep=True)

Index          128
CURROPER     60280
INSTNM      660699
dtype: int64

In [21]:
college.loc[0, 'CURROPER'] = 10000000
college.loc[0, 'INSTNM'] = college.loc[0, 'INSTNM'] + 'a'

In [22]:
college[['CURROPER', 'INSTNM']].memory_usage(deep=True) # mem increase only for INSTNM

Index          128
CURROPER     60280
INSTNM      660700
dtype: int64

In [23]:
college.index.memory_usage()

128

In [24]:
pd.Int64Index(college.index).memory_usage()

60280

### getting smallest and largest data

In [25]:
movie = pd.read_csv('data/movie.csv')
movie2 = movie[['movie_title', 'imdb_score', 'budget']]
movie2.head()

                                  movie_title  imdb_score       budget
0                                      Avatar         7.9  237000000.0
1    Pirates of the Caribbean: At World's End         7.1  300000000.0
2                                     Spectre         6.8  245000000.0
3                       The Dark Knight Rises         8.5  250000000.0
4  Star Wars: Episode VII - The Force Awakens         7.1          NaN

In [26]:
movie2.nlargest(100, 'imdb_score').head()    # best imdb score movie

                   movie_title  imdb_score      budget
2725          Towering Inferno         9.5         NaN
1920  The Shawshank Redemption         9.3  25000000.0
3402             The Godfather         9.2   6000000.0
2779                   Dekalog         9.1         NaN
4312      Kickboxer: Vengeance         9.1  17000000.0

In [27]:
movie2.nlargest(100, 'imdb_score').nsmallest(20, 'budget').head()   # top 100 imdb score with lowest budget

               movie_title  imdb_score    budget
4804        Butterfly Girl         8.7  180000.0
4801    Children of Heaven         8.5  180000.0
4706          12 Angry Men         8.9  350000.0
4550          A Separation         8.4  500000.0
4636  The Other Dream Team         8.4  500000.0

#### getting highest ranking mvoie for each year

In [31]:
movie2 = movie[['movie_title', 'imdb_score', 'title_year']]
movie2.head()

                                  movie_title  imdb_score  title_year
0                                      Avatar         7.9      2009.0
1    Pirates of the Caribbean: At World's End         7.1      2007.0
2                                     Spectre         6.8      2015.0
3                       The Dark Knight Rises         8.5      2012.0
4  Star Wars: Episode VII - The Force Awakens         7.1         NaN

In [33]:
movie2.sort_values('title_year', ascending=False).head()

                       movie_title  imdb_score  title_year
3884                      The Veil         4.7      2016.0
2375    My Big Fat Greek Wedding 2         6.1      2016.0
2794          Miracles from Heaven         6.8      2016.0
92    Independence Day: Resurgence         5.5      2016.0
153                Kung Fu Panda 3         7.2      2016.0

In [35]:
movie3 = movie2.sort_values(['title_year', 'imdb_score'], ascending=False)
movie3.head()

                      movie_title  imdb_score  title_year
4312         Kickboxer: Vengeance         9.1      2016.0
4277  A Beginner's Guide to Snuff         8.7      2016.0
3798                      Airlift         8.5      2016.0
27     Captain America: Civil War         8.2      2016.0
98            Godzilla Resurgence         8.2      2016.0

In [37]:
movie_top_year = movie3.drop_duplicates(subset='title_year')
movie_top_year

                                           movie_title  imdb_score  title_year
4312                              Kickboxer: Vengeance         9.1      2016.0
3745                                   Running Forever         8.6      2015.0
4369                            Queen of the Mountains         8.7      2014.0
3935           Batman: The Dark Knight Returns, Part 2         8.4      2013.0
3                                The Dark Knight Rises         8.5      2012.0
...                                                ...         ...         ...
2694                                        Metropolis         8.3      1927.0
4767                                    The Big Parade         8.3      1925.0
4833                    Over the Hill to the Poorhouse         4.8      1920.0
4695  Intolerance: Love's Struggle Throughout the Ages         8.0      1916.0
2725                                  Towering Inferno         9.5         NaN

[92 rows x 3 columns]

#### getting highest budget movie for each year

In [51]:
movie4 = movie[['movie_title', 'budget', 'title_year', 'imdb_score']]
movie4 = movie4.sort_values(
                ['title_year', 'budget'], 
                ascending=[False, False])

In [53]:
movie4 = movie4.drop_duplicates(subset=['title_year'])
movie4.head()

,movie_title,budget,title_year,imdb_score
10,Batman v Superman: Dawn of Justice,250000000.0,2016.0,6.9
8,Avengers: Age of Ultron,250000000.0,2015.0,7.5
20,The Hobbit: The Battle of the Five Armies,250000000.0,2014.0,7.5
15,Man of Steel,225000000.0,2013.0,7.2
5,John Carter,263700000.0,2012.0,6.6

#### movie with highest budgest and least rating

In [54]:
movie4.sort_values(
                ['budget', 'imdb_score'], 
                ascending=[False, True]).head()

            movie_title        budget  title_year  imdb_score
3787     Lady Vengeance  4.200000e+09      2005.0         7.7
2294  Princess Mononoke  2.400000e+09      1997.0         8.4
2305           Steamboy  2.127520e+09      2004.0         6.9
3361              Akira  1.100000e+09      1988.0         8.1
4440      Godzilla 2000  1.000000e+09      1999.0         6.0

#### using sort_values vs nsmallest/nlargest

In [67]:
movie4 = movie[['movie_title', 'imdb_score', 'budget']]

In [68]:
res1 = movie4.nlargest(100, 'imdb_score').nsmallest(5, 'budget')
res1.head()

               movie_title  imdb_score    budget
4804        Butterfly Girl         8.7  180000.0
4801    Children of Heaven         8.5  180000.0
4706          12 Angry Men         8.9  350000.0
4550          A Separation         8.4  500000.0
4636  The Other Dream Team         8.4  500000.0

In [70]:
res2 = movie4.sort_values('imdb_score', ascending=False)
res2.head(100).sort_values('budget').head()

                    movie_title  imdb_score    budget
4815  A Charlie Brown Christmas         8.4  150000.0
4801         Children of Heaven         8.5  180000.0
4804             Butterfly Girl         8.7  180000.0
4706               12 Angry Men         8.9  350000.0
4636       The Other Dream Team         8.4  500000.0